/*while(条件式){条件を満たしている間、繰り返す処理
}*/

//祝日の配列を作成
let holidaysTwo = ["正月","成人の日","建国記念日","天皇誕生日","春分の日","昭和の日","憲法記念日","みどりの日","こどもの日","海の日","山の日","敬老の日","秋分の日","スポーツの日","文化の日","勤労感謝の日"];

let i = 0;
while(i < holidaysTwo.length){
  console.log(holidaysTwo[i]);
  i++;
}


 //祝日の配列を作成
const holidays = ["正月","成人の日","建国記念日","天皇誕生日","春分の日","昭和の日","憲法記念日","みどりの日","こどもの日","海の日","山の日","敬老の日","秋分の日","スポーツの日","文化の日","勤労感謝の日"];

//配列の値を出力する
console.log(holidays);

/*for (カウンタ変数の初期値; 条件式; カウンタ変数の増減値) {
 カウンタ変数が決まった値になるまで繰り返す処理の 
 }*/
for (let i = 0; i < holidays.length; i++) {
  console.log(holidays[i])
}
